Tekla Open API Reference for Tekla Structures 2025
EdgeChamfer Constructor (Point, Point)
 Initializes a new instance of the EdgeChamfer class.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public EdgeChamfer(
	Point FirstEnd,
	Point SecondEnd
)
Public Sub New (
	FirstEnd As Point,
	SecondEnd As Point
)
Parameters
FirstEnd
Type: Tekla.Structures.Geometry3d.Point
The first end point of the edge chamfer.
SecondEnd
Type: Tekla.Structures.Geometry3d.Point
The second end point of the edge chamfer.
See Also
Reference
EdgeChamfer Class
EdgeChamfer Overload
Tekla.Structures.Model Namespace